# -*- coding: utf-8 -*-
import random

USER = input("Введіть ім'я : ")
USERHP = 100
USERATTACK = 20
EFFECT = None
ENEMY1HP = 20
ENEMY2HP = 60
BOSS = 100

def attack():
    CRIT = random.randint(1,100)
    if CRIT >= 80:
        print('\nК Р И Т И Ч Н И Й  У Д А Р')
        print('\nВи нанесли {} урону.'.format(USERATTACK*2))
        return(USERATTACK*2)
    else:
        print('\nВи нанесли {} урону.'.format(USERATTACK)) 
        return(USERATTACK)

def enemyattack(attack):
    global USERHP
    CRIT = random.randint(1,100)
    if CRIT >= 80:
        print('\nК Р И Т И Ч Н И Й  У Д А Р')
        USERHP -= attack*2
        print('\nВам нанесли {} урону.'.format(attack*2))
    else:
        USERHP -= attack
        print('\nВам нанесли {} урону.'.format(attack))  
  

print("""\nВи прокинулись в таємничій кімнаті, останнє \nщо ви пам'ятаєте - це вчорашня весела ніч з друзями.\n
Раптом ви почули рух в коридорі.Ви визирнули \nз дверей і побачили лежачого чоловіка.\n
Придивившись, ви помітили плями крові на сорочці. Ваші дії.""")

while True:
    global LVL1

    LVL1 = input('\n1 - допомогти, 2 - зайти в кімнату і перевірити смс на телефоні : ')

    if LVL1 != '1' and LVL1 != '2':
        print('\nВи ввели неправильну дію. Повторіть спробу.')
        continue
        
    elif LVL1 == '1':
        print("""\nВи наблизились до чоловіка, і перевіривши \nпульс зрозуміли, що він вже не живий.\nУ вашій голові було
дуже багато незрозумілих думок...Що сталося?...\nДе я?... Чому тут цей мертвий чоловік?...\nВи мучили себе питаннями,
і навіть не помітили як чоловік,\nякий ще декілька хвилин тому був мертвим, поворухнувся...""")
        break

    elif LVL1 == '2':
        print("""\nВи були налякані, у вашій голові було дуже багато незрозумілих думок...\n
Що сталося?... Де я?..., ви вирішили повернутися в\nкімнату з якої вийшли, і все обдумати.\n
Витративши декілька десятків хвилин на роздуми, ви помітили\nсвій мобільний на столі. У ньому ви прочитали незрозумілу смс
від невідомого номера.\nТам було написано ЗОМ...Недочитавши смс, ви почули гучний крик з коридору.""")
        break


if LVL1 == '1':
    
    
    print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
    
    print("\nЗдоров'я чоловіка - {}".format(ENEMY1HP))
    print('\nЧоловік почав повзти до вас. Ви були настільки не в собі, що не чули нічого.\nЦим ви і поплатились. Чоловік вкусив вас за ногу.')
    
    enemyattack(20)
       
    print('\n$$$ Н а к л а в с я  е ф ф е к т  з о м б у в а н н я (-20 ХП за хід) $$$')
    EFFECT = True
    
    if EFFECT == True :
        USERHP-=20
        print('\n-20 ХП через еффект зомбування')
    
	while True:
        global LVL2

        LVL2 = input('\n1 - Ударити чоловіка ногою, 2 - Втекти в кімнату : ')

        if LVL2 != '1' and LVL2 != '2':
            print('\nВи ввели неправильну дію. Повторіть спробу.')
            continue
            
        elif LVL2 == '1':
            print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
            ENEMY1HP -= attack()
            print("""\nВи вбили його. Згадавши своє минуле в Афганістані, вам було однаково.\nВи не були одним з персонажів тих
фільмів, де в місто проникає ЗОМБІ вірус,\nа вони цього не розуміють. Ви зрозуміли це зразу. """)
            break

        elif LVL2 == '2':
            print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
            print("""\nВи втекли в кімнату. Це був розумний вчинок.\nВам потрібно було чимось залатати ногу.""")
            break


if LVL1 == '2':
    print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
    print("""\nЗазвичай, крики в коридорі не відбуваються просто так.\n
Не зважаючи на ваше важке минуле в Афганістані, ви все-таки вагаєтесь.\nВиходити на коридор чи ні?""")
    
	while True:
        LVL2 = input('\n1 - Залишитися в кімнаті, 2 - Вийти в коридор : ')
        
        if LVL2 != '1' and LVL2 != '2':
            print('\nВи ввели неправильну дію. Повторіть спробу.')
            continue
            
        elif LVL2 == '1':
            print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
            print("""\nВи вирішили не виходити в коридор. Можливо це було гарне рішення,\nтому, що ви знайшли аптечку в шафі.""")
            break

        elif LVL2 == '2':
            print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
            print("""\nВашим рішенням було все-таки вийти в коридор.\nХоча ви і були хоробрі, від смерті вас це не врятувало.\n
На вас накинувся той самий чоловік і загриз до смерті.\n""")
            break
    
if LVL1 == '1' and LVL2 == '1':
    print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
    
    if EFFECT == True :
        USERHP-=20
        print('\n-20 ХП через еффект зомбування')
    
    print("""\nЗараз ви бажали тільки одного. Знайти вихід з цього Богом покинутого будинку.\n
Ви повернулись в кімнату, в надії щось знайти. І в вас це вийшло. Ви знайшли\n
пістолет з патронами і аптечку.""")
    USERHP = 100
    
	print("""\nВи використали аптечку, і пішли далі. Ви знайшли головний вихід з будинку,\nале там стояв зомбі.""")
    
	input('Почати боротьбу?')
    
    while True :
        if USERHP <= 0:
            print('Ви були вбиті. КІНЕЦЬ ГРИ')
            exit()
        if BOSS <= 0:
            print("""\nВи вбили його. Ви врятовані. Вийшовши з будинку ви побачили повністю\nздорових і живих людей. Це кінець.
Ви обернулись тому, що захотіли побачити,\nщо це було за жахливе місце. На дверях з яких ви вийшли писало\n'ПУНКТ ЗДАЧІ ЗНО'""")
            exit()
        if USERHP >= 0 or BOSS >= 0:    
            BOSS = BOSS - attack()
            print('{} ХП В БОСА'.format(BOSS))
            enemyattack(15)
            print('{} ХП У ВАС'.format(USERHP))
        
            
        
if LVL1 == '1' and LVL2 == '2':
    
    print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
    
    if EFFECT == True :
        USERHP-=20
        print('\n-20 ХП через еффект зомбування')
    
    print("""\nЗараз ви бажали тільки одного. Знайти вихід з цього Богом покинутого будинку.\n
Ви повернулись в кімнату, в надії щось знайти. І в вас це вийшло. Ви знайшли\n
пістолет з патронами""")
    print("""\nВи пішли далі. Ви знайшли головний вихід з будинку,\nале там стояв зомбі.""")
    
    input('Почати боротьбу?')
    
    while True :
        if USERHP <= 0:
            print('Ви були вбиті. КІНЕЦЬ ГРИ')
            exit()
        if BOSS <= 0:
            print("""\nВи вбили його. Ви врятовані. Вийшовши з будинку ви побачили повністю\nздорових і живих людей. Це кінець.
Ви обернулись тому, що захотіли побачити,\nщо це було за жахливе місце. На дверях з яких ви вийшли писало\n'ПУНКТ ЗДАЧІ ЗНО'""")
            exit()
        if USERHP >= 0 or BOSS >= 0:    
            BOSS = BOSS - attack()
            print('{} ХП В БОСА'.format(BOSS))
            enemyattack(15)
            print('{} ХП У ВАС'.format(USERHP))

if LVL1 == '2' and LVL2 == '1':
    print('\nВаш Урон - {}. Ваше ХП - {}'.format(USERATTACK, USERHP))
    
    print("""\nЗараз ви бажали тільки одного. Знайти вихід з цього Богом покинутого будинку.\n
Поки ви шукали вихід, на вас напав зомбі.""")
    
    input('Почати боротьбу?')
   
    while True :
        if USERHP <= 0:
            print('Ви були вбиті. КІНЕЦЬ ГРИ')
            exit()
        if ENEMY2HP <= 0:
            print("""\nВи вбили його.""")
        if USERHP >= 0 or BOSS >= 0:    
            ENEMY2HP = ENEMY2HP - attack()
            print('{} ХП В ПРОТИВНИКА'.format(ENEMY2HP))
            enemyattack(10)
            print('{} ХП У ВАС'.format(USERHP))
            
    print("""\nЦей зомбі буй ще тим противником. Він покалічив вас дуже сильно.\nВи пробували зробити щось з аптечкою але відключилися.\n
Очнулися ви вже в ПАЛІТЕХУ.\nНа дощці писало щось незрозуміле, але\nви побачили, що всі вивчають ІФ4ИКИ. Ви зрозуміли що все це був сон. КІНЕЦЬ ГРИ""")
    exit()
if LVL1 == '2' and LVL2 == '2':
    print('КІНЕЦЬ ГРИ |'*5)
    exit()
